In [1]:
import pandas as pd

In [2]:
color = pd.DataFrame.from_dict([{'red':'빨강', 'yellow':'노랑', 'blue':'파랑', 'green':'초록'}])
color

  red yellow blue green
0  빨강     노랑   파랑    초록

In [3]:
import psycopg2
import numpy as np

In [12]:
greenplum.close()
gp_cursor.close()

In [78]:
greenplum = psycopg2.connect(host='3.37.51.214', database='test_db', user='testuser', password='1234')
gp_cursor = greenplum.cursor()

gp_cursor.execute("select red, yellow, blue, green from public.color")
data = gp_cursor.fetchall()

color = pd.DataFrame(data, columns = ['red', 'yellow', 'blue', 'green'])
color

  red yellow blue green
0  빨강     노랑   파랑    초록

In [43]:
color.loc[2] = [np.nan, np.nan, np.nan, np.nan, np.nan]
color

   red yellow blue green pink
0   빨강     노랑   파랑    초록  NaN
1    가      나  NaN     라    마
2  NaN    NaN  NaN   NaN  NaN

In [41]:
color = color.dropna(axis = 'index', how = 'all', subset=['green', 'pink'])
color

  red yellow blue green pink
0  빨강     노랑   파랑    초록  NaN
1   가      나  NaN     라    마

In [49]:
df = pd.DataFrame({'red' : ['가', '가1'], 'yellow' : ['나', '나1'], 'blue' : ['다', '다1'], 'green' : ['라', '라1']})
df

  red yellow blue green
0   가      나    다     라
1  가1     나1   다1    라1

In [17]:
new_color = color.append(df, ignore_index = True)
new_color

C:\Users\82109\AppData\Local\Temp\ipykernel_12864\1824984228.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  new_color = color.append(df, ignore_index = True)

  red yellow blue green
0  빨강     노랑   파랑    초록
1   가      나    다     라
2  가1     나1   다1    라1

In [79]:
color.loc[1] = ['가', '나', '다', '라']
color

  red yellow blue green
0  빨강     노랑   파랑    초록
1   가      나    다     라

In [58]:
color['num'] = color.index
color

  red yellow blue green  num
0  빨강     노랑   파랑    초록    0
1   가      나    다     라    1
2  가1     나1   다1    라1    2

In [69]:
color

  red yellow blue green
5  빨강     노랑   파랑    초록
6   가      나    다     라
7  가1     나1   다1    라1

In [71]:
color.reset_index(drop = True, inplace = True)
color

  red yellow blue green
0  빨강     노랑   파랑    초록
1   가      나    다     라
2  가1     나1   다1    라1

In [73]:
color.set_index('red', drop = True, inplace = True)
color

    yellow blue green
red
빨강      노랑   파랑    초록
가        나    다     라
가1      나1   다1    라1

In [75]:
color.set_index('yellow', drop = True, append = True, inplace = True)
color

           blue green
red yellow
빨강  노랑       파랑    초록
가   나         다     라
가1  나1       다1    라1

In [76]:
color.set_index('blue', drop = True, append = False, inplace = True)
color

     green
blue
파랑      초록
다        라
다1      라1

In [68]:
color.index = color.index+1
color

  red yellow blue green
5  빨강     노랑   파랑    초록
6   가      나    다     라
7  가1     나1   다1    라1

In [62]:
color = color.drop(['num'], axis = 1)

In [5]:
color['pink'] = '분홍'
color

  red yellow blue green pink
0  빨강     노랑   파랑    초록   분홍

In [6]:
color.insert(1, 'pink', '분홍')
color

ValueError: cannot insert pink, already exists

In [ ]:
color = color.drop(['pink'], axis = 1)
color

In [38]:
import numpy as np
color['pink'] = np.nan
color

  red yellow blue green  pink
0  빨강     노랑   파랑    초록   NaN

In [7]:
color.rename(columns = {'blue':'sky', 'green':'tree'}, inplace=True)
color

  red yellow sky tree pink
0  빨강     노랑  파랑   초록   분홍

In [8]:
color = color[['green', 'red', 'blue', 'yellow']]
color

KeyError: "['green', 'blue'] not in index"

In [ ]:
from datetime import datetime
color['date'] = pd.Timestamp(datetime.now())
color

In [ ]:
color['date'] = color['date'].map(lambda ts: ts.strftime("%Y-%m-%d %H:%M:%S"))
color

In [11]:
color.isnull().sum()

red       0
yellow    0
blue      0
green     0
pink      1
dtype: int64

In [47]:
color

  red yellow blue green pink
0  빨강     노랑   파랑    초록    0
1   가      나    0     라    마
2   0      0    0     0    0

In [46]:
color = color.fillna('0')
color

  red yellow blue green pink
0  빨강     노랑   파랑    초록    0
1   가      나    0     라    마
2   0      0    0     0    0

In [80]:
color

  red yellow blue green
0  빨강     노랑   파랑    초록
1   가      나    다     라

In [83]:
fruit = pd.DataFrame.from_dict([{'red':'빨강', '바나나':'banana', '포도':'grape', '오렌지':'orange'}])
fruit

  red     바나나     포도     오렌지
0  빨강  banana  grape  orange

In [89]:
color

  red yellow blue green
0  빨강     노랑   파랑    초록
1   가      나    다     라

In [88]:
fruit

  red     바나나     포도     오렌지
0  빨강  banana  grape  orange
1   가       1      2       3

In [87]:
new2 = pd.concat([color,fruit], axis = 1, join = 'inner')
new2

  red yellow blue green red     바나나     포도     오렌지
0  빨강     노랑   파랑    초록  빨강  banana  grape  orange
1   가      나    다     라   가       1      2       3